DataProcessors/ГенераторОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ГенераторОпераций</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НепереодическиеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НепереодическиеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ресурс1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Измерение1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ГенераторОпераций/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Запустить(Команда)
	ЗапуститьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьНаСервере()  
	//СоздатьДанныеДляТеста();
	
	НачатьТранзакцию();                     
	ДанныеДляЗаписи = Неопределено;
	Для каждого Выбор из ПорядокОпераций Цикл   
		НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();     
		Операция = Выбор.Значение;
		Попытка
			Если Операция = "Объектное чтение" Тогда
				ДанныеДляЗаписи = ОбъектноеЧтение();
			ИначеЕсли Операция = "Чтение запросом" Тогда
				ДанныеДляЗаписи = ЧтениеЗапросом();
			ИначеЕсли Операция = "Чтение запросом для изменения" Тогда
				ДанныеДляЗаписи = ЧтениеЗапросомДляИзменения();
			ИначеЕсли Операция = "Запись" Тогда
				ОбновитьИЗаписать(ДанныеДляЗаписи);
			КонецЕсли;    
			
			СлужебныеСервер.ВызватьПаузу(ТаймаутМеждуОперациями);    
			
			КонецЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
			Сообщить(Операция + ". Время выполнения: " + Строка(КонецЗамера - НачалоЗамера) + " мс");
		Исключение 
			КонецЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
			Сообщить(Операция + ". Ошибка: " + Строка(КонецЗамера - НачалоЗамера) + " мс");  
			Прервать;
		КонецПопытки;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры     

&НаСервереБезКонтекста
Процедура СоздатьДанныеДляТеста() 
	НаборЗаписейДляТеста = РегистрыСведений.НепереодическиеСведения.СоздатьНаборЗаписей();
	Запись = НаборЗаписейДляТеста.Добавить();
	Запись.Измерение1 = "Тест";
	Запись.Ресурс1 = "";
	НаборЗаписейДляТеста.Записать(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбъектноеЧтение()    
	НаборЗаписей = РегистрыСведений.НепереодическиеСведения.СоздатьНаборЗаписей();      
	НаборЗаписей.Отбор.Измерение1.Установить("Тест");
	НаборЗаписей.Прочитать();  
	
	Возврат НаборЗаписей.Выгрузить();
КонецФункции

&НаСервереБезКонтекста
Функция ЧтениеЗапросом()  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НепереодическиеСведения.Измерение1 КАК Измерение1,
	|	НепереодическиеСведения.Ресурс1 КАК Ресурс1
	|ИЗ
	|	РегистрСведений.НепереодическиеСведения КАК НепереодическиеСведения
	|ГДЕ
	|	НепереодическиеСведения.Измерение1 = ""Тест""";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

&НаСервереБезКонтекста
Функция ЧтениеЗапросомДляИзменения()    
	// В управляемом режиме игнорирует ДЛЯ ИЗМЕНЕНИЯ
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НепереодическиеСведения.Измерение1 КАК Измерение1,
	|	НепереодическиеСведения.Ресурс1 КАК Ресурс1
	|ИЗ
	|	РегистрСведений.НепереодическиеСведения КАК НепереодическиеСведения
	|ГДЕ
	|	НепереодическиеСведения.Измерение1 = ""Тест""
	|
	|ДЛЯ ИЗМЕНЕНИЯ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


&НаСервереБезКонтекста
Процедура ОбновитьИЗаписать(ДанныеДляЗаписи)  
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, 10000);
	
	НаборЗаписей = РегистрыСведений.НепереодическиеСведения.СоздатьНаборЗаписей();
	Для каждого ТекущаяЗапись из ДанныеДляЗаписи Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Измерение1 = ТекущаяЗапись.Измерение1;
		Запись.Ресурс1 = СлучайноеЧисло;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПорядокОпераций.Добавить("Объектное чтение");     
	ПорядокОпераций.Добавить("Запись");
	
КонецПроцедуры
